---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ExtrusionDirection
source: html/5f5c831f-f0dd-f46a-028c-dd0d6ac09123.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.ExtrusionDirection Property

The extrusion direction to generate an extrusion.

## Syntax (C#)
```csharp
public XYZ ExtrusionDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null